Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: དེ་བཞིན་ཉིད་དང་། མ་ནོར་བ་དེ་བཞིན་ཉིད་དང་། གཞན་མ་ཡིན་པ་དེ་བཞིན་ཉིད་དང་། ཆོས་ཉིད་དང་། ཆོས་ཀྱི་དབྱིངས་དང་། ཆོས་ཀྱི་གནས་ཉིད་དང་། ཆོས་མི་འགྱུར་བ་ཉིད་དང་། ཡང་དག་པའི་མཐའ་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་དང་། བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བའི་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་པ་དང་། རྟག་ཏུ་བཏང་སྙོམས་ལ་གནས་པ་དང་། མི་ཉམ་པའི་ཆོས་ཉིད་ཀྱི་ཡོན་ཏན་ནི་ཇི་སྙེད་ཅིག་བརྗོད་པར་བགྱི་སྟེ།
en: The attributes of the undiminished reality [and all the rest] are immeasurable.

source: མི་ཉམ་པའི་ཆོས་ཉིད་ཀྱི་ཡོན་ཏན་ནི་ཚད་མ་མཆིས་སོ། །དེ་བཞིན་གཤེགས་པའི་སྐུ་གདུང་དེ་དག་ཀྱང་མི་ཉམ་པའི་ཆོས་ཉིད་ཀྱི་སྣོད་དོ།
en: Those bone relics of the tathāgatas are indeed the basket containing the undiminished reality [and so forth].

source: །དེ་བས་ན་དེ་བཞིན་གཤེགས་པའི་སྐུ་གདུང་དེ་དག་ནི་མཆོད་པ་མངའོ།
en: It is for this reason that the bone relics of the tathāgatas are presented with offerings. “

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པའི་སྐུ་གདུང་དེ་དག་ནི་ཕ་རོལ་དུ་ཕྱིན་པ་རིན་པོ་ཆེའི་སྣོད་དོ།
en: Blessed Lord, those bone relics of the tathāgatas are the container of the precious perfections.

source: །དེ་བཞིན་གཤེགས་པའི་སྐུ་གདུང་དེ་དག་ནི་ཕ་རོལ་དུ་ཕྱིན་པ་ཀུན་ནས་ཉོན་མོངས་པ་མ་མཆིས་པ་རྣམ་པར་བྱང་བ་མ་མཆིས་པ་དང་། ཕ་རོལ་དུ་ཕྱིན་པ་མི་སྐྱེ་མི་འགག་པ་དང་། ཕ་རོལ་དུ་ཕྱིན་པ་བླང་བ་མ་མཆིས་དོར་བ་མ་མཆིས་པ་དང་། ཕ་རོལ་དུ་ཕྱིན་པ་དབྲི་བ་མ་མཆིས་བསྣན་པ་མ་མཆིས་པ་དང་། ཕ་རོལ་དུ་ཕྱིན་པ་འོང་བ་མ་མཆིས་འགྲོ་བ་མ་མཆིས།
en: Those bone relics of the tathāgatas are the container of the perfections that are neither afflicted nor purified, the perfections that are neither arising nor ceasing, the perfections that are without acceptance and without rejection, the perfections that are without subtraction or addition, and the perfections that are without coming, going, or staying.

source: གནས་པ་མ་མཆིས་པའི་སྣོད་དོ། །དེ་བས་ན་དེ་བཞིན་གཤེགས་པའི་སྐུ་གདུང་དེ་དག་ནི་མཆོད་པ་མངའོ།
en: It is for this reason that the bone relics of the tathāgatas are presented with offerings. “

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པའི་སྐུ་གདུང་དེ་དག་ནི་ཕ་རོལ་དུ་ཕྱིན་པའི་ཆོས་ཉིད་ཀྱི་སྣོད་དེ།
en: Blessed Lord, those bone relics of the tathāgatas are the container of the reality of the perfections.

source: དེ་བཞིན་གཤེགས་པའི་སྐུ་གདུང་དེ་དག་ནི་ཕ་རོལ་དུ་ཕྱིན་པའི་ཆོས་ཉིད་ཀྱིས་ཡོངས་སུ་བསྒོས་པའོ།
en: Those bone relics of the tathāgatas are exalted, owing to the reality of the perfections.

source: །དེ་བས་ན་དེ་བཞིན་གཤེགས་པ་མྱ་ངན་ལས་འདས་ཀྱང་། དེ་བཞིན་གཤེགས་པའི་སྐུ་གདུང་དེ་དག་ནི་མཆོད་པ་མངའོ།
en: Therefore, even after the tathāgatas have passed into nirvāṇa, those bone relics of the tathāgatas are presented with offerings. “

source: །གཞན་ཡང་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་དེ་བཞིན་གཤེགས་པའི་སྐུ་གདུང་གིས་བྱུར་བུར་ཡོངས་སུ་གཏམས་པ་ལྟ་ཞོག །བཅོམ་ལྡན་འདས་གལ་ཏེ་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཅིག །དེ་བཞིན་གཤེགས་པའི་སྐུ་གདུང་གིས་བྱུར་བུར་གཏམས་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་གླེགས་བམ་དུ་བྲིས་པ་ཞིག་སྩལ་ན། བཅོམ་ལྡན་འདས་རྣམ་པ་དེ་གཉིས་ལས་བདག་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཉིད་ལེན་ཏོ།
en: Moreover, leaving aside the world systems of the great trichiliocosm, which are filled to the brim with the bone relics of the tathāgatas, Blessed Lord, if I were offered all the world systems of the ten directions, numerous as the grains of sand of the river Gaṅgā, filled to the brim with the bone relics of the tathāgatas, and the perfection of wisdom, committed to writing in the form of a book, then, Blessed Lord, of these two I would take this perfection of wisdom.

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་འདི་ལས་བྱུང་བ་ནི། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་སྐུ་གདུང་རྣམས་ཏེ་མཆོད་པ་མངའོ།
en: If one were to ask why, Blessed Lord, the bone relics of the tathāgatas, arhats, completely awakened buddhas have originated from this [perfection of wisdom], and they are consequently presented with offerings. “

source: །བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་བསྒོམས་པས་ན། དེ་བཞིན་གཤེགས་པའི་སྐུ་གདུང་དེ་དག་མཆོད་པ་མངའ་སྟེ། བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་གང་དེ་བཞིན་གཤེགས་པའི་སྐུ་གདུང་རྣམས་ལ་རིམ་གྲོར་བགྱིད་པ་དང་། བཀུར་སྟིར་བགྱིད་པ་དང་། བསྟི་སྟང་དུ་བགྱིད་པ་དང་།
en: Blessed Lord, those bone relics of the tathāgatas are presented with offerings because the perfection of wisdom has been cultivated.

source: མཆོད་པར་བགྱིད་པ་ཡང་དགེ་བའི་རྩ་བ་དེའི་མཐའ་མི་དམིགས་ཤིང་། རྒྱལ་རིགས་ཆེ་ཞིང་མཐོ་བའམ། བྲམ་ཟེའི་རིགས་ཆེ་ཞིང་མཐོ་བའམ། ཁྱིམ་བདག་གི་རིགས་ཆེ་ཞིང་མཐོ་བའམ། རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་འམ། སུམ་ཅུ་རྩ་གསུམ་མམ། མཚེ་མ་འམ། དགའ་ལྡན་ནམ། འཕྲུལ་དགའ་འམ། གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷའི་ནང་དུ་མི་དང་།
en: Blessed Lord, the noble sons or noble daughters who, even though they serve, respect, honor, and worship those bone relics of the tathāgatas, do not perceive an end to their roots of virtuous action, and they will experience happiness, along with the excellence of human beings and gods, among great and lofty royal families, great and lofty priestly families, or great and lofty householder families—or among the gods of the Caturmahā­rāja­kāyika realm, or the gods of Trayastriṃśa, Yāma, Tuṣita, Nirmāṇarata, or Para­nirmita­vaśa­vartin—and then they will put an end to suffering.

source: ལྷའི་ཕུན་སུམ་ཚོགས་པ་དང་། བདེ་བ་མྱོང་ནས་དགེ་བའི་རྩ་བ་དེ་ཉིད་ཀྱིས་སྡུག་བསྔལ་གྱི་མཐར་འབྱུང་སྟེ། དེ་བཞིན་གཤེགས་པའི་སྐུ་གདུང་མཆོད་པའི་འབྲས་བུ་ལྟ་དེ་ཙམ་དུ་བས་ཀྱི། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་བཟུང་ཞིང་བཅངས་པ་དང་། བླགས་ཤིང་ཀུན་ཆུབ་པར་བགྱིས་པ་དང་།
en: Such are the fruits of worshiping the bone relics of the tathāgatas. “

source: ཚུལ་བཞིན་དུ་ཡིད་ལ་བགྱིས་ན། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: But on the other hand, if they take up, uphold, recite, master, and focus their attention correctly on this perfection of wisdom, they will fulfill the perfection of generosity, and they will fulfill the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, {Ki.

source: བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: II-III: 96} the perfection of meditative concentration, and the perfection of wisdom.

source: །ནང་སྟོང་པ་ཉིད་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: They will fulfill the emptiness of internal phenomena, and they will fulfill [all the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities.

source: །བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་བར་དུ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: They will fulfill the thirty-seven factors conducive to enlightenment, and they will fulfill [the fruitional attributes], up to and including the eighteen distinct qualities of the buddhas.

source: །དེ་ཆེད་དུ་བསམས་ཏེ་ལུས་ཡོངས་སུ་འཛིན་པར་འགྱུར་རོ། །ལུས་དེ་དག་གིས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བགྱིད་པར་འགྱུར་ཏེ། འཁོར་ལོས་སྒྱུར་བའི་ལུས་སམ། །རྒྱལ་རིགས་ཆེ་ཞིང་མཐོ་བའམ། བྲམ་ཟེའི་རིགས་ཆེ་ཞིང་མཐོ་བའམ།
en: Intentionally they will acquire a physical body, and through their physical bodies they will bring beings to maturation.

source: ཁྱིམ་བདག་གི་རིགས་ཆེ་ཞིང་མཐོ་བའི་ལུས་སམ། བརྒྱ་བྱིན་གྱི་གཟུགས་སམ། ཚངས་པའི་གཟུགས་སམ། ངལ་བསོ་པོའི་གཟུགས་ཀྱང་རུང་སྟེ། དེ་ལུས་དེ་དག་གིས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བགྱིད་པར་འགྱུར་རོ།
en: Whether in the form of an imperial monarch, or that of a member of a great and lofty royal family, a great and lofty priestly family, or a great and lofty householder family, or else the form of Śakra, the form of Brahmā, or the form of Viśrāntin, they will bring beings to maturation through their physical bodies. “

source: །ཉན་ཐོས་ཀྱི་ས་དང་། རང་སངས་རྒྱས་ཀྱི་ས་ལས་འདས་ཏེ། བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པར་འཇུག་པར་འགྱུར་རོ། །བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པར་ཞུགས་ནས།
en: Transcending the level of the śrāvakas and the level of the pratyekabuddhas, they will enter a bodhisattva’s full maturity.

source: བྱང་ཆུབ་སེམས་དཔའི་མངོན་པར་ཤེས་པ་འཐོབ་པར་འགྱུར་རོ།
en: Having entered into the maturity of the bodhisattvas, they will attain the extrasensory powers of the bodhisattvas.

source: །བྱང་ཆུབ་སེམས་དཔའི་མངོན་པར་ཤེས་པ་ཐོབ་ནས། སངས་རྒྱས་ཀྱི་ཞིང་ནས་སངས་རྒྱས་ཀྱི་ཞིང་དུ་མཆི་བར་འགྱུར་རོ།
en: Having attained the extrasensory powers of the bodhisattvas, they will journey from buddhafield to buddhafield. “

source: །བཅོམ་ལྡན་འདས་དེ་བས་ན་བདག་ནི་དེ་བཞིན་གཤེགས་པའི་སྐུ་གདུང་ལ་རིམ་གྲོ་མ་མཆིས་པ་ཡང་མ་ལགས། གློ་བ་མཆིས་པ་ཡང་མ་མཆིས།
en: So, Blessed Lord, it is not that I do not honor the bone relics of the tathāgatas.

source: མཆོད་པར་མི་འཚལ་བ་ཡང་མ་ལགས།
en: It is not that I do not respect them.

source: གཟུང་བར་མི་འཚལ་བ་ཡང་མ་ལགས་ཏེ། བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་རྣམས་ཀྱིས་རིམ་གྲོ་དང་།
en: It is not that I do not venerate them.

source: བཀུར་སྟི་དང་།
en: It is not that I do not worship them.

source: བསྟི་སྟང་དང་།
en: It is not that I do not hold them.

source: མཆོད་པ་བགྱིས་ན་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཀྱི་རྒྱུ་ཤིན་དུ་བསགས་པ་ལགས། ཕུན་སུམ་ཚོགས་པ་ཐམས་ཅད་ཀྱང་ཡོངས་སུ་ཟིན་པར་འགྱུར། དེ་བཞིན་གཤེགས་པའི་སྐུ་གདུང་རྣམས་ལ་ཡང་རིམ་གྲོ་དང་། བཀུར་སྟི་དང་། བསྟི་སྟང་དང་། མཆོད་པ་བགྱིད་པར་འགྱུར་རོ།
en: But, Blessed Lord, if noble sons or noble daughters serve, respect, honor, and worship this perfection of wisdom, they absolutely do accumulate the causal basis of all the attributes of the buddhas, they will also acquire all excellences, and they will also serve, respect, honor, and worship the bone relics of the tathāgatas. “

source: །བཅོམ་ལྡན་འདས་གཞན་ཡང་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཚད་དང་གྲངས་མ་མཆིས་པ་དག་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཇི་སྙེད་ཅིག་བཞུགས་ཤིང་འཚོ་སྐྱོང་བ་དང་། ཆོས་སྟོན་པ་དེ་དག་ཆོས་ཀྱི་སྐུ་དང་། གཟུགས་ཀྱི་སྐུ་དང་། ཡེ་ཤེས་ཀྱི་སྐུར་མཐོང་བར་འཚལ་ཞིང་མཆོད་པར་འཚལ་བས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཉིད་གཟུང་བར་བགྱི། བཅང་བར་བགྱི། ཀླག་པར་བགྱི། ཀུན་ཆུབ་པར་བགྱི།
en: Moreover, Blessed Lord, those wishing to behold and wishing to worship the tathāgatas, arhats, completely awakened buddhas who are alive at present, residing in the immeasurable and innumerable world systems of the ten directions, whether in the buddha body of reality, the buddha body of form, or the buddha body of wisdom, should take up, uphold, recite, master, and worship this very perfection of wisdom, and they should also teach it extensively to others.

source: མཆོད་པར་བགྱི། གཞན་ལ་ཡང་རྒྱ་ཆེར་ཡང་དག་པར་བསྟན་པར་བགྱི། ཚུལ་བཞིན་དུ་ཡང་ཡིད་ལ་བགྱིད་ཏེ། རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དེས་ནི་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་གྲངས་དང་ཚད་མ་མཆིས་པའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་མཐོང་བར་འགྱུར་རོ།
en: Having focused their attention correctly on it, those noble sons or noble daughters will consequently behold the tathāgatas, arhats, completely awakened buddhas in the countless and immeasurable world systems of the ten directions.

source: །དེ་བས་ན་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་དེས། ཆོས་ཉིད་དུ་སངས་རྒྱས་རྗེས་སུ་དྲན་པ་བསྒོམ་པར་བགྱིའོ། །བཅོམ་ལྡན་འདས་གཞན་ཡང་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་མཐོང་བར་འཚལ་བས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་གཟུང་བར་བགྱི།
en: Therefore, those noble sons or noble daughters who practice the perfection of wisdom should cultivate the recollection of the Buddha in reality. “

source: བཅང་བར་བགྱི། ཀླག་པར་བགྱི། ཀུན་ཆུབ་པར་བགྱི། མཆོད་པར་བགྱི། གཞན་ལ་ཡང་རྒྱ་ཆེར་ཡང་དག་པར་བསྟན་པར་བགྱི།
en: Moreover, Blessed Lord, the noble sons or noble daughters who wish to behold those tathāgatas, arhats, completely awakened buddhas should take up, uphold, recite, master, and worship this perfection of wisdom, and they should also teach it extensively to others.

source: ཆོས་ཉིད་ཚུལ་བཞིན་དུ་ཡང་ཡིད་ལ་བགྱིའོ།
en: They should also focus their attention correctly on reality. “

source: །བཅོམ་ལྡན་འདས་གཉིས་པོ་འདི་དག་ནི་ཆོས་ཉིད་དེ།
en: Blessed Lord, there are two aspects to reality.

source: གཉིས་གང་ཞེ་ན། འདུས་བྱས་ཀྱི་ཆོས་རྣམས་ཀྱི་ཆོས་ཉིད་དང་། འདུས་མ་བྱས་ཀྱི་ཆོས་རྣམས་ཀྱི་ཆོས་ཉིད་དོ།
en: If one were to ask what are these two, they comprise the reality of conditioned phenomena and the reality of unconditioned phenomena.

source: །བཅོམ་ལྡན་འདས་དེ་ལ་འདུས་བྱས་ཀྱི་ཆོས་རྣམས་ཀྱི་ཆོས་ཉིད་གང་ལགས་ཤེ་ན། ནང་སྟོང་པ་ཉིད་ཀྱི་ཡེ་ཤེས་དང་།
en: Blessed Lord, in this regard, what, one might ask, is the reality of conditioned phenomena?

source: ཕྱི་སྟོང་པ་ཉིད་ཀྱི་ཡེ་ཤེས་དང་། ཕྱི་ནང་སྟོང་པ་ཉིད་ཀྱི་ཡེ་ཤེས་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་གྱི་ཡེ་ཤེས་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་གྱི་ཡེ་ཤེས་དང་། འཕགས་པའི་བདེན་པ་བཞི་དང་། བསམ་གཏན་བཞི་དང་། ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པའི་ཡེ་ཤེས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་ཡེ་ཤེས་དང་།
en: The reality of conditioned phenomena is said to comprise the wisdom of the emptiness of internal phenomena; the wisdom of the emptiness of external phenomena; the wisdom of the emptiness of external and internal phenomena; the wisdom of [all the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities; the wisdom of the thirty-seven factors conducive to enlightenment, the wisdom of the four truths of the noble ones, and the wisdom of the four meditative concentrations, the four immeasurable attitudes, the four formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, and the gateways of liberation—emptiness, signlessness, and wishlessness; the wisdom of the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, [great loving kindness], great compassion, and the eighteen distinct qualities of the buddhas; the wisdom of virtuous and nonvirtuous phenomena; {Ki.

source: དགེ་བ་དང་མི་དགེ་བའི་ཆོས་རྣམས་ཀྱི་ཡེ་ཤེས་དང་། ཟག་པ་མེད་པ་དང་། ཟག་པ་དང་བཅས་པའི་ཆོས་རྣམས་ཀྱི་ཡེ་ཤེས་དང་། འཇིག་རྟེན་པ་དང་། འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་རྣམས་ཀྱི་ཡེ་ཤེས་གང་ལགས་པ་དེ་ནི།
en: II-III: 97} the wisdom of uncontaminated and contaminated phenomena; and the wisdom of mundane and supramundane phenomena. “

source: འདུས་བྱས་ཀྱི་ཆོས་རྣམས་ཀྱི་ཆོས་ཉིད་ཅེས་བགྱིའོ། །དེ་ལ་འདུས་མ་བྱས་ཀྱི་ཆོས་རྣམས་ཀྱི་ཆོས་ཉིད་གང་ལགས་ཤེ་ན། དེ་ནི་གང་ལ་སྐྱེ་བ་མ་མཆིས་པ་དང་། འགག་པ་མ་མཆིས་པ་དང་། གནས་པ་མ་མཆིས་པ་དང་། གནས་པ་ལས་གཞན་དུ་འགྱུར་བ་མ་མཆིས་པ་དང་།
en: What, one might ask, is the reality of unconditioned phenomena?

source: ཀུན་ནས་ཉོན་མོངས་པ་མ་མཆིས་པ་དང་། རྣམ་པར་བྱང་བ་མ་མཆིས་པ་དང་། འཕེལ་བ་མ་མཆིས་པ་དང་། འགྲིབ་པ་མ་མཆིས་པ་སྟེ། དེ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་ངོ་བོ་ཉིད་དོ།
en: This denotes the essential nature of all phenomena, which is without arising and without ceasing, without abiding and without anything other than abiding, without affliction and without purification, and without increase and without decrease.

source: །ཆོས་ཐམས་ཅད་ཀྱི་ངོ་བོ་ཉིད་གང་ལགས་ཤེ་ན། ཆོས་ཐམས་ཅད་ནི་དངོས་པོ་མ་མཆིས་པའི་ངོ་བོ་ཉིད་དེ།
en: If you ask what is the essential nature of all phenomena, all phenomena have the essential nature of nonentity.

source: འདི་ནི་འདུས་མ་བྱས་ཀྱི་ཆོས་རྣམས་ཀྱི་ཆོས་ཉིད་ཅེས་བགྱིའོ།
en: This is called the reality of unconditioned phenomena.” “

source: འདས་པའི་དུས་ཀྱི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གང་ཇི་སྙེད་ཅིག་བྱུང་བ་དེ་དག་ཀྱང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཉིད་ལ་རྟེན་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ།
en: All the tathāgatas, arhats, completely awakened buddhas of the past also attained consummate buddhahood in unsurpassed, complete enlightenment, dependent on this perfection of wisdom.

source: །མ་འོངས་པའི་དུས་ཀྱི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གང་ཇི་སྙེད་ཅིག་འབྱུང་བ་དེ་དག་ཀྱང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཉིད་ལ་རྟེན་ཅིང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ།
en: All the tathāgatas, arhats, completely awakened buddhas who will appear in the future will also attain consummate buddhahood in unsurpassed, complete enlightenment, dependent on this perfection of wisdom.

source: །ད་ལྟར་བྱུང་བའི་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཚད་མེད་གྲངས་མེད་པ་དག་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གང་ཇི་སྙེད་ཅིག་བཞུགས་ཤིང་འཚོ་སྐྱོང་བ་དང་། ཆོས་སྟོན་པ་དེ་དག་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཉིད་ལ་བརྟེན་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ།
en: All the tathāgatas, arhats, completely awakened buddhas who are alive at present, residing in the immeasurable and countless world systems of the ten directions, and even now teaching the Dharma, all attained consummate buddhahood in unsurpassed, complete enlightenment, dependent on this perfection of wisdom. “

source: །འདས་པའི་དུས་ཀྱི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་ཉན་ཐོས་གང་ཇི་སྙེད་ཅིག་བྱུང་བ་དང་། མ་བྱོན་པའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་ཉན་ཐོས་གང་ཇི་སྙེད་ཅིག་འབྱུང་བ་དང་། ད་ལྟར་བྱུང་བའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་ཉན་ཐོས་གང་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་གིས་ཀྱང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཉིད་ལ་བརྟེན་ཏེ། རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་དང་། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་ཐོབ་བོ། །འཐོབ་བོ། །ཐོབ་པར་འགྱུར་རོ།
en: All the śrāvakas of those tathāgatas, arhats, completely awakened buddhas of the past who have appeared, all the śrāvakas of those tathāgatas, arhats, completely awakened buddhas of the future who will appear, and all the śrāvakas of those tathāgatas, arhats, completely awakened buddhas of the present also respectively have attained, will attain, and are attaining the fruit of entering the stream to nirvāṇa, the fruit of being tied to one rebirth, the fruit of no longer being subject to rebirth, and arhatship. “

source: །འདས་པའི་དུས་ཀྱི་རང་སངས་རྒྱས་གང་ཇི་སྙེད་ཅིག་བྱུང་བ་དང་། མ་འོངས་པའི་དུས་ཀྱི་རང་སངས་རྒྱས་གང་ཇི་སྙེད་ཅིག་འབྱུང་བ་དང་། ད་ལྟར་བྱུང་བའི་འཇིག་རྟེན་གྱི་ཁམས་གྲངས་མེད་ཚད་མེད་པ་དག་ན། རང་སངས་རྒྱས་གང་ཇི་སྙེད་ཅིག་འཁོད་ཅིང་འཚོ་སྐྱོང་བ་དེ་དག་གིས་ཀྱང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཉིད་ལ་བརྟེན་ཏེ་རང་བྱང་ཆུབ་ཐོབ་བོ།། །།
en: All the pratyekabuddhas of the past who have appeared, all the pratyekabuddhas of the future who will appear, and all the pratyekabuddhas who are alive at present, residing in countless and immeasurable world systems, also respectively have attained, will attain, and are attaining individual enlightenment, dependent on this perfection of wisdom. “

source: འཐོབ་བོ། །ཐོབ་པར་འགྱུར་རོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: If you ask why, {Ki.

source: འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལས་ཐེག་པ་གསུམ་པོ་ཐམས་ཅད་རྒྱ་ཆེར་བསྟན་ཏེ། དེ་དག་ཀྱང་མཚན་མ་མེད་པའི་ཚུལ་དང་། དམིགས་པ་མེད་པའི་ཚུལ་དང་། སྐྱེ་བ་མེད་པའི་ཚུལ་དང་། འགག་པ་མེད་པའི་ཚུལ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དང་། རྣམ་པར་བྱང་བ་མེད་པའི་ཚུལ་དང་། མངོན་པར་འདུ་བྱ་བ་མེད་པའི་ཚུལ་དང་། ལེན་པ་མེད་པ་དང་། འདོར་བ་མེད་པའི་ཚུལ་དང་། དབྲི་བ་མེད་པ་དང་། བསྣན་པ་མེད་པའི་ཚུལ་དང་།
en: II-III: 98} it is because the three vehicles are all extensively revealed through this perfection of wisdom, and they are indeed revealed in the manner of signlessness, in the manner of nonapprehending, in the manner of nonarising, in the manner of nonceasing, in the manner of nonaffliction and nonpurification, in the manner of nonconditioning, in the manner of nonacceptance and nonrejection, in the manner of nonsubtraction and nonaddition, and in the manner of nongrasping and nonabandoning. “

source: བླང་བ་མེད་པ་དང་། སྤང་བ་མེད་པའི་ཚུལ་གྱིས་བསྟན་ཏེ། དེ་ཡང་འཇིག་རྟེན་གྱི་ཐ་སྙད་ཀྱི་ཚུལ་གྱིས་བསྟན་གྱི། དོན་དམ་པར་ནི་མ་ཡིན་ནོ།
en: Although these are indeed revealed according to the conventional ways of the world, ultimately that is not the case.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་རིང་དུ་སོང་བ་མ་ཡིན། ཕ་རོལ་དུ་ཕྱིན་པ་མ་ཡིན་ཏེ།
en: If you ask why, it is because this perfection of wisdom is neither remote nor alien.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་ཚུ་རོལ་མ་ཡིན། ཕ་རོལ་མ་ཡིན། ཐད་དུ་འདུག་པ་མ་ཡིན། གཤོར་དུ་འདུག་པ་མ་ཡིན། མཉམ་པ་མ་ཡིན།
en: The perfection of wisdom is neither imminent nor plain nor contoured.

source: མི་མཉམ་པ་མ་ཡིན། མཚན་མ་མ་ཡིན། མཚན་མ་མེད་པ་མ་ཡིན། འཇིག་རྟེན་པ་མ་ཡིན། འཇིག་རྟེན་ལས་འདས་པ་མ་ཡིན། འདུས་བྱས་མ་ཡིན། འདུས་མ་བྱས་མ་ཡིན། དགེ་བ་མ་ཡིན། མི་དགེ་བ་མ་ཡིན།
en: It is neither flat nor uneven, it neither has signs nor is without signs, it is neither mundane nor supramundane, it is neither conditioned nor is it unconditioned, it is neither virtuous nor nonvirtuous, and it is neither past, nor future, nor present. “

source: འདས་པ་མ་ཡིན། མ་འོངས་པ་མ་ཡིན། ད་ལྟར་བྱུང་བ་མ་ཡིན་ཏེ། ཀཽ་ཤི་ཀ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཉེ་བར་སྒྲུབ་པ་མ་ཡིན་ཏེ།
en: Kauśika, the perfection of wisdom does not establish the attributes of the buddhas.

source: དགྲ་བཅོམ་པའི་བར་གྱི་ཆོས་རྣམས་དང་།
en: It does not establish the attributes of the [other fruits and realizations], up to and including arhatship.

source: རང་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཉེ་བར་སྒྲུབ་པ་མ་ཡིན།
en: It does not establish the attributes of the pratyekabuddhas.

source: །སོ་སོའི་སྐྱེ་བོའི་ཆོས་རྣམས་འདོར་བ་མ་ཡིན་ནོ།
en: It does not forsake the attributes of ordinary persons.”

source: །བརྒྱ་བྱིན་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་ཕ་རོལ་དུ་ཕྱིན་པ་ཆེན་པོ་སྟེ།
en: Śakra replied, “Blessed Lord, this perfection of wisdom is a great transcendence.

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལ་སྤྱོད་པ་རྣམས་ནི། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་དང་སྤྱོད་པ་ཡང་འཚལ་ཏེ། སེམས་ཅན་དུ་དམིགས་པ་མ་མཆིས་སོ། །སེམས་ཅན་དུ་གདགས་པར་དམིགས་པ་མ་མཆིས་སོ། །བདག་དང་། སེམས་ཅན་དང་། སྲོག་དང་། འགྲོ་བ་དང་། གསོ་བ་དང་།
en: Blessed Lord, the bodhisattva great beings who practice this perfection of wisdom indeed know the minds and conduct of all beings, but they do not apprehend beings.

source: སྐྱེས་བུ་དང་། གང་ཟག་དང་།
en: They do not apprehend anything called a being.

source: ཤེད་ཅན་དང་། ཤེད་བདག་དང་བྱེད་པ་པོ་དང་། ཚོར་བ་པོ་དང་། ཤེས་པ་པོ་དང་། མཐོང་བ་པོར་དམིགས་པ་མ་མཆིས་སོ།
en: They do not apprehend selves, sentient beings, life forms, living beings, life, living creatures, individuals, human beings, people, actors, experiencers, knowers, or viewers.

source: །གཟུགས་སུ་དམིགས་པ་མ་མཆིས། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པར་དམིགས་པ་མ་མཆིས་སོ།
en: They do not apprehend physical forms, and they do not apprehend feelings, perceptions, formative predispositions, or consciousness.

source: །མིག་དུ་དམིགས་པ་མ་མཆིས། ཡིད་ཀྱི་བར་དུ་དམིགས་པ་མ་མཆིས་སོ།
en: They do not apprehend the eyes, and they do not apprehend [the other sense organs], up to and including the mental faculty.

source: །གཟུགས་སུ་དམིགས་པ་མ་མཆིས། ཆོས་ཀྱི་བར་དུ་དམིགས་པ་མ་མཆིས་སོ།
en: They do not apprehend sights, and they do not apprehend [the other sense objects], up to and including mental phenomena.

source: །མིག་གི་རྣམ་པར་ཤེས་པར་དམིགས་པ་མ་མཆིས། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་བར་དུ་དམིགས་པ་མ་མཆིས་སོ།
en: They do not apprehend visual consciousness, and they do not apprehend [the other aspects of consciousness], up to and including mental consciousness.

source: །མིག་གི་འདུས་ཏེ་རེག་པར་དམིགས་པ་མ་མཆིས། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་བར་དུ་དམིགས་པ་མ་མཆིས་སོ།
en: They do not visually compounded sensory contact, and they do not apprehend [the other aspects of sensory contact], up to and including mentally compounded sensory contact.

source: །མིག་གི་འདུས་ཏེ་རེག་པ་ལས་བྱུང་བའི་ཚོར་བར་དམིགས་པ་མ་མཆིས། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པ་ལས་བྱུང་བའི་ཚོར་བའི་བར་དུ་དམིགས་པ་མ་མཆིས་སོ། །སའི་ཁམས་སུ་དམིགས་པ་མ་མཆིས་སོ། ཆུའི་ཁམས་དང་།
en: They do not apprehend feelings arising from visually compounded sensory contact, and they do not apprehend [the other aspects of feelings conditioned by sensory contact], up to and including feelings arising from mentally compounded sensory contact.
